xml/CDataSection.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:mh="http://www.Monson-Haefel.com/jwsbook/BookQuote" 
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:xsd="http://www.w3c.org/2001/XMLSchema" 
	xmlns:xsi="http://www.w3c.org/2001/XMLSchema-instance">
	<soap:Body>
		<!--THIS IS A TEST COMMENT-->
		<mh:getBookPrice>
			<isbn xsi:type="xsd:string">0321146182</isbn>
		</mh:getBookPrice>
	</soap:Body>
</soap:Envelope>